sg9924/stm32f103_Segment_Displays/Drivers/Src/stm32f103xx_timer.c
#include"stm32f103xx_timer.h"
#include"stm32f103xx_rcc.h"


void TIM_PClk_init(TIM_RegDef* TIMx, uint8_t mode)
{
    if(mode == ENABLE)
    {
        if(TIMx == TIM2)
            TIM2_PCLK_ENABLE();
        else if(TIMx == TIM3)
            TIM3_PCLK_ENABLE();
    }
    else if(mode == DISABLE)
    {
        if(TIMx == TIM2)
            TIM2_PCLK_DISABLE();
        else if(TIMx == TIM3)
            TIM3_PCLK_DISABLE();
    }
}


void TIM_P_init(TIM_RegDef* TIMx, uint8_t mode)
{
    if(mode == ENABLE)
    {
        if(TIMx == TIM2)
            TIM2_ENABLE();
        else if(TIMx == TIM3)
            TIM3_ENABLE();
    }
    else if(mode == DISABLE)
    {
        if(TIMx == TIM2)
            TIM2_DISABLE();
        else if(TIMx == TIM3)
            TIM3_DISABLE();
    }
}


void TIM_Base_Configure(TIM_Handle* pTIMHandle, TIM_RegDef* pTIMx, uint8_t count_direction, uint32_t prescale_value, uint32_t autoreload_value, uint8_t ar_preload)
{
    pTIMHandle->pTIMx                                = pTIMx;
    pTIMHandle->TIMx_Base_Config.ar_preload          = ar_preload;
    pTIMHandle->TIMx_Base_Config.autoreload_value    = autoreload_value;
    pTIMHandle->TIMx_Base_Config.count_direction     = count_direction;
    pTIMHandle->TIMx_Base_Config.prescale_value      = prescale_value;
}

void TIM_Base_init(TIM_Handle* pTIMHandle)
{
    //enable Timer peripheral clock
    TIM_PClk_init(pTIMHandle->pTIMx, ENABLE);

    //configure count direction
    if(pTIMHandle->TIMx_Base_Config.count_direction == TIM_COUNT_DIR_DOWN)
        pTIMHandle->pTIMx->CR1 |= 1<<TIM_CR1_DIR;
    else if(pTIMHandle->TIMx_Base_Config.count_direction == TIM_COUNT_DIR_UP)
        pTIMHandle->pTIMx->CR1 &= ~(1<<TIM_CR1_DIR); //default direction
    
    //configure prescale value
    TIM_PSC_LOAD(pTIMHandle->pTIMx, pTIMHandle->TIMx_Base_Config.prescale_value);
    //TIM_Prescaler_Load(pTIMHandle, pTIMHandle->TIMx_Base_Config.prescale_value);

    //configure auto reload value
    TIM_ARR_LOAD(pTIMHandle->pTIMx, pTIMHandle->TIMx_Base_Config.autoreload_value);
    //TIM_AutoReload_Load(pTIMHandle, pTIMHandle->TIMx_Base_Config.autoreload_value);

    //configure auto reload preload type
    if(pTIMHandle->TIMx_Base_Config.ar_preload == TIM_AR_PRELOAD_ENABLE)
        TIM_ARPE_SET(pTIMHandle->pTIMx);
        //pTIMHandle->pTIMx->CR1 |= 1<<TIM_CR1_ARPE;
    else if(pTIMHandle->TIMx_Base_Config.ar_preload == TIM_AR_PRELOAD_DISABLE)
        TIM_ARPE_CLEAR(pTIMHandle->pTIMx);
        //pTIMHandle->pTIMx->CR1 &= ~(1<<TIM_CR1_ARPE);
    
    //configure for only Overflow/underflow
    pTIMHandle->pTIMx->CR1 |= 1<<TIM_CR1_URS;

    //update shadow registers
    TIM_SHADOW_UPDATE(pTIMHandle->pTIMx);
    //TIM_Shadow_Reg_Update(pTIMHandle);

    //clear status flags
    TIM_STATUS_CLEAR(pTIMHandle->pTIMx, (1<<TIM_SR_CC1IF | 1<<TIM_SR_CC2IF | 1<<TIM_SR_CC3IF | 1<<TIM_SR_CC4IF | 1<<TIM_SR_UIF));
    //TIM_Status_Clear(pTIMHandle, (1<<TIM_SR_CC1IF | 1<<TIM_SR_CC2IF | 1<<TIM_SR_CC3IF | 1<<TIM_SR_CC4IF | 1<<TIM_SR_UIF));
}



void TIM_OC_Configure(TIM_Handle* pTIMHandle, TIM_OC_Handle* pTIMOCHandle, uint8_t oc_mode, uint8_t oc_channel, uint8_t oc_polarity, uint8_t oc_preload, uint16_t oc_value)
{
    pTIMOCHandle->pTIMHandle                      = pTIMHandle;
    pTIMOCHandle->pTIMHandle->pTIMx               = pTIMHandle->pTIMx;

    pTIMOCHandle->TIMx_OC_Config.oc_channel       = oc_channel;
    pTIMOCHandle->TIMx_OC_Config.oc_preload       = oc_preload;
    pTIMOCHandle->TIMx_OC_Config.oc_mode          = oc_mode;
    pTIMOCHandle->TIMx_OC_Config.oc_polarity      = oc_polarity;
    //pTIMOCHandle->TIMx_OC_Config.oc_value         = oc_value;
}



void TIM_OC_Channel_init(TIM_OC_Handle* pTIMOCHandle)
{
    uint8_t channel         = pTIMOCHandle->TIMx_OC_Config.oc_channel;
    uint8_t mode            = pTIMOCHandle->TIMx_OC_Config.oc_mode;
    uint8_t polarity        = pTIMOCHandle->TIMx_OC_Config.oc_polarity;

    //uint8_t word_offset     = channel/2;
    //uint8_t ch_bit_offset   = (channel%2)*8;
    //uint8_t mode_bit_offset = (channel%2)?4:12;
    //uint8_t pol_bit_offset  = 1+(channel*4);

    //set channel as output
    TIM_OC_CC_SEL_CLEAR(pTIMOCHandle->pTIMHandle->pTIMx, channel);
    //pTIMOCHandle->pTIMHandle->pTIMx->CCMR[word_offset] |= ~(1<<ch_bit_offset);

    //Set OC Mode
    if(mode == TIM_OC_MODE_FROZEN)
        TIM_OC_MODE_CLEAR(pTIMOCHandle->pTIMHandle->pTIMx, channel);
        //pTIMOCHandle->pTIMHandle->pTIMx->CCMR[word_offset] |= ~(1<<mode_bit_offset);
    else 
        TIM_OC_MODE_CONFIG(pTIMOCHandle->pTIMHandle->pTIMx, channel, mode);
        //pTIMOCHandle->pTIMHandle->pTIMx->CCMR[word_offset] |= 1<<mode_bit_offset;

    //Set OC Polarity
    if(polarity == TIM_OC_POL_ACTIVE_HIGH)
        TIM_OC_POL_SET_ACTIVE_HIGH(pTIMOCHandle->pTIMHandle->pTIMx, channel);
    else if(polarity == TIM_OC_POL_ACTIVE_LOW)
        TIM_OC_POL_SET_ACTIVE_LOW(pTIMOCHandle->pTIMHandle->pTIMx, channel);

    //OC Preload Enable
    TIM_OC_PRELOAD_SET(pTIMOCHandle->pTIMHandle->pTIMx, channel);
    //pTIMOCHandle->pTIMHandle->pTIMx->CCMR[word_offset] |= 1<<((channel%2)?3:11);

    //trigger update event to load registers for preload enable
    if(pTIMOCHandle->TIMx_OC_Config.oc_preload == TIM_OC_PRELOAD_ENABLE || pTIMOCHandle->pTIMHandle->TIMx_Base_Config.ar_preload == TIM_AR_PRELOAD_ENABLE)
        TIM_GEN_UPDATE_EVENT(pTIMOCHandle->pTIMHandle->pTIMx, channel);  
        //TIM_Update_Event_Trigger(pTIMOCHandle->pTIMHandle);

    //clear status flag due to EGR
    TIM_UIF_STATUS_CLEAR(pTIMOCHandle->pTIMHandle->pTIMx);
}


void TIM_OC_init(TIM_OC_Handle* pTIMOCHandle)
{
    //Base init
    TIM_Base_init(pTIMOCHandle->pTIMHandle);

    //Output Channel init
    TIM_OC_Channel_init(pTIMOCHandle);

    //Enable Interrupts if any
    TIM_Interrupt_init(pTIMOCHandle->pTIMHandle->pTIMx,
                       pTIMOCHandle->pTIMHandle->TIMx_Intrpt_Config.interrupt_type,
                       pTIMOCHandle->TIMx_OC_Config.oc_channel,
                       pTIMOCHandle->pTIMHandle->TIMx_Intrpt_Config.interrupt_mode);
}





void TIM_Base_Start(TIM_Handle* pTIMHandle)
{
    TIM_P_init(pTIMHandle->pTIMx, ENABLE);
}

void TIM_Base_Stop(TIM_Handle* pTIMHandle)
{
    TIM_P_init(pTIMHandle->pTIMx, DISABLE);
}

void TIM_OC_Start(TIM_OC_Handle* pTIMOCHandle, uint8_t channel)
{
    pTIMOCHandle->pTIMHandle->pTIMx->CCER |= 1<<(channel*4);
    TIM_Base_Start(pTIMOCHandle->pTIMHandle);
}

void TIM_OC_Stop(TIM_OC_Handle* pTIMOCHandle, uint8_t channel)
{
    pTIMOCHandle->pTIMHandle->pTIMx->CCER |= ~(1<<(channel*4));
    TIM_Base_Start(pTIMOCHandle->pTIMHandle);
}

void TIM_Prescaler_Load(TIM_Handle* pTIMHandle, uint32_t prescale_value)
{
    pTIMHandle->TIMx_Base_Config.prescale_value = prescale_value;
    pTIMHandle->pTIMx->PSC = prescale_value - 1;
}

void TIM_AutoReload_Load(TIM_Handle* pTIMHandle, uint32_t auto_reload_value)
{
    pTIMHandle->TIMx_Base_Config.autoreload_value = auto_reload_value;
    pTIMHandle->pTIMx->ARR = auto_reload_value - 1;
}

void TIM_Shadow_Reg_Update(TIM_Handle* pTIMHandle)
{
    pTIMHandle->pTIMx->EGR |= 1<<TIM_EGR_UG;
}

void TIM_Status_Clear(TIM_Handle* pTIMHandle, uint16_t flags)
{
    pTIMHandle->pTIMx->SR &= ~(flags);
}

void TIM_Count_Reset(TIM_Handle* pTIMHandle)
{
    pTIMHandle->pTIMx->CNT = 0;
}

void TIM_Update_Event_Check(TIM_Handle* pTIMHandle)
{
    //wait till UIF becomes 1
    while(!(pTIMHandle->pTIMx->SR & 1<<TIM_SR_UIF));

    //clear UIF flag
    TIM_Status_Clear(pTIMHandle, (1<<TIM_SR_UIF));
}

void TIM_Update_Event_Trigger(TIM_Handle* pTIMHandle)
{
    pTIMHandle->pTIMx->EGR |= 1<<TIM_EGR_UG;
    pTIMHandle->pTIMx->SR |= ~(1<<TIM_SR_UIF);
}

void TIM_Interrupt_init(TIM_RegDef* pTIMx, uint8_t interrupt_type, uint8_t channel, uint8_t mode)
{
    uint8_t bit_offset = (interrupt_type == TIM_UPDATE_INTRPT)?TIM_UPDATE_INTRPT:(channel + interrupt_type);
    if(mode == ENABLE)
    {
        //Enable interrupt in Timer
        pTIMx->DIER |= 1<<bit_offset;

        //Enable Interrupt in NVIC
        if(pTIMx == TIM2)
            nvic_intrpt_enable(TIM2_IRQ_NO);
        else if(pTIMx == TIM3)
            nvic_intrpt_enable(TIM3_IRQ_NO);
        else if(pTIMx == TIM4)
            nvic_intrpt_enable(TIM4_IRQ_NO);
    }
    else if(mode == DISABLE)
    {
        //Enable interrupt in Timer
        pTIMx->DIER |= ~(1<<bit_offset);

        //Enable Interrupt in NVIC
        if(pTIMx == TIM2)
            nvic_intrpt_disable(TIM2_IRQ_NO);
        else if(pTIMx == TIM3)
            nvic_intrpt_disable(TIM3_IRQ_NO);
        else if(pTIMx == TIM4)
            nvic_intrpt_disable(TIM4_IRQ_NO);
    }

}

void TIM_DMA_Init(TIM_RegDef* pTIMx, uint8_t dma_type, uint8_t channel, uint8_t mode)
{
    uint8_t bit_offset = (dma_type == TIM_TRIG_DMA)?TIM_TRIG_DMA:(channel + dma_type);
    if(mode == ENABLE)
        pTIMx->DIER |= 1<<bit_offset;
    else if(mode == DISABLE)
        pTIMx->DIER |= ~(1<<bit_offset);
}







//Interrupts
void Timer_Update_Callback(TIM_RegDef* pTIM)
{
    ;
}


void TIM3_IRQHandler(void)
{
    if(TIM3->SR & 1<<TIM_SR_UIF)
    {
        TIM_STATUS_CLEAR(TIM3, 1<<TIM_SR_UIF);
        Timer_Update_Callback(TIM3);
    }
}